local Translations = {
    progress = {
        ['snowballs'] = 'Συλλογή χιονόμπαλων..',
    },
    notify = {
        ['failed'] = 'Αποτυχία',
        ['canceled'] = 'Ακυρώθηκε',
        ['vlocked'] = 'Το όχημα είναι κλειδωμένο',
        ['notowned'] = 'Δεν είσαι ο ιδιοκτήτης αυτού του αντικειμένου!',
        ['missitem'] = 'Δεν έχεις αυτό το αντικείμενο!',
        ['nonb'] = 'Κανείς κοντά!',
        ['noaccess'] = 'Μη προσβάσιμο',
        ['nosell'] = 'Δεν μπορείς να πουλήσεις αυτό το αντικείμενο..',
        ['itemexist'] = 'Το αντικείμενο δεν υπάρχει',
        ['notencash'] = 'Δεν έχεις αρκετά μετρητά..',
        ['noitem'] = 'Δεν έχεις τα σωστά αντικείμενα..',
        ['gsitem'] = 'Δεν μπορείς να δώσεις αντικείμενο στον εαυτό σου;',
        ['tftgitem'] = 'Είσαι πολύ μακριά για να δώσεις αντικείμενα!',
        ['infound'] = 'Το αντικείμενο που προσπάθησες να δώσεις δεν βρέθηκε!',
        ['iifound'] = 'Βρέθηκε λανθασμένο αντικείμενο, δοκίμασε ξανά!',
        ['gitemrec'] = 'Έλαβες ',
        ['gitemfrom'] = ' Από ',
        ['gitemyg'] = 'Έδωσες ',
        ['gitinvfull'] = 'Το απόθεμα του άλλου παίκτη είναι γεμάτο!',
        ['giymif'] = 'Το απόθεμά σου είναι γεμάτο!',
        ['gitydhei'] = 'Δεν έχεις αρκετό από το αντικείμενο',
        ['gitydhitt'] = 'Δεν έχεις αρκετά αντικείμενα για μεταφορά',
        ['navt'] = 'Μη έγκυρος τύπος..',
        ['anfoc'] = 'Τα επιχειρήματα δεν συμπληρώθηκαν σωστά..',
        ['yhg'] = 'Έδωσες ',
        ['cgitem'] = 'Δεν μπορείς να δώσεις το αντικείμενο!',
        ['idne'] = 'Το αντικείμενο δεν υπάρχει',
        ['pdne'] = 'Ο παίκτης δεν είναι συνδεδεμένος',
    },
    inf_mapping = {
        ['opn_inv'] = 'Άνοιγμα Αποθέματος',
        ['tog_slots'] = 'Εναλλαγή θέσεων συντομεύσεων',
        ['use_item'] = 'Χρησιμοποιεί το αντικείμενο στη θέση ',
    },
    menu = {
        ['vending'] = 'Μηχάνημα Αυτόματης Πώλησης',
        ['bin'] = 'Άνοιγμα Κάδου',
        ['craft'] = 'Κατασκευή',
        ['o_bag'] = 'Άνοιγμα Τσάντας',
    },
    interaction = {
        ['craft'] = '~g~E~w~ - Κατασκευή',
    },
}

Lang = Lang or Locale:new({
    phrases = Translations,
    warnOnMissing = true
})
